cskilbeck/distance_sensor/firmware/CH32V003F4P6/User/user_main.cpp
//////////////////////////////////////////////////////////////////////
//
// x    Common message stuff between ESP12 and CH32
// x    ESP12 Tasks (x WiFi, SPI etc)
// x    ESP http send
// x    Server/Database
// x    SPI Slave mode
// x    CH32 Sleep/standby for N minutes
// x    Button wakeup
// x    Handshake ESP/CH32 boot via MOSI? But.. janky current thing is working...
// x    Measure power consumption
// x    Factory reset (long button press)
// !    B2B Connector
//      Alexa notification
//      Email notification
//      Enclosure
//
//      Status/history web page (Go templates + FastCGI) (Grafana?)
//
//////////////////////////////////////////////////////////////////////

#define DEBUG

#if defined(DEBUG)
#include <stdio.h>
#endif

#include <memory.h>

#include <ch32v00x.h>
#include <ch32v00x_conf.h>
#include <ch32v00x_gpio.h>

#include "int_types.h"
#include "user_gpio.h"
#include "user_pins.h"
#include "crc.h"

#define SYSTICK_SR_CNTIF 0x01

#define SYSTICK_CTLR_ENABLE 0x01
#define SYSTICK_CTLR_INTEN 0x02
#define SYSTICK_CTLR_HCLK 0x04
#define SYSTICK_CTLR_AUTORE 0x08

#define PFIC_SCTLR_SLEEPDEEP 0x04
#define PFIC_SCTLR_WFITOWFE 0x08
#define PFIC_SCTLR_SEVONPEND 0x10
#define PFIC_SCTLR_SETEVENT 0x20

#define PWR_AWUEN 0x02

#if defined(DEBUG)
#define debug printf
#else
#define debug(...) do {} while (false)
#endif

#if defined(DEBUG)
#define SLEEP_DELAY_TICKS 100
#else
#define SLEEP_DELAY_TICKS 1
#endif

//////////////////////////////////////////////////////////////////////

namespace
{
    static constexpr int MAX_VALID_DISTANCE = 7000;
    static constexpr int MAX_DISTANCE_TRIES = 5;

    enum state_t
    {
        state_boot = 0,
        state_reading,
        state_wait_for_esp,
        state_esp,
        state_done,
        state_num
    };

#if defined(DEBUG)
    char const *state_name[state_num] =
    {
                    "boot",
                    "reading",
                    "wait_for_esp",
                    "esp",
                    "done"
    };
#endif

    //////////////////////////////////////////////////////////////////////
    // status of a system (spi, vbat adc etc)

    enum status_t
    {
        status_idle,
        status_in_progress,
        status_complete
    };

    //////////////////////////////////////////////////////////////////////
    // what readings have been got so far

    enum readings_t
        : uint32
    {
        got_reading_vbat = 1,
        got_reading_distance = 2,
        got_reading_all = 3
    };

    //////////////////////////////////////////////////////////////////////

    struct stopwatch_t
    {
        uint32 now;

        uint32 elapsed() const;
        void reset();
    };

    //////////////////////////////////////////////////////////////////////

    struct button_t
    {
        uint16 history;
        union
        {
            struct
            {
                volatile uint16 pressed :1;
                volatile uint16 released :1;
                volatile uint16 held :1;
            };
            uint16 flags;
        };

        void update(int state);
    };

    //////////////////////////////////////////////////////////////////////

    extern "C"
    {
        void TIM1_CC_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
        void SysTick_Handler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
        void ADC1_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
        void DMA1_Channel2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
        void DMA1_Channel3_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
    }

    void spi_start();
    void init_peripherals();
    void set_state(state_t new_state);

    //////////////////////////////////////////////////////////////////////

    // main system state

    state_t state = state_boot;
    uint32 state_start_ticks;

    // status of some peripheral handlers

    volatile status_t vbat_status = status_idle;
    volatile status_t spi_status = status_idle;
    volatile status_t distance_status = status_idle;

    // systicks

    volatile uint32 ticks;

    // SPI buffers are double size - 1st half of tx and second half of rx are discarded
    // because ch32 spi is in full duplex mode but esp12 can't seem to do that, it
    // sends then receives the packet sequentially

    uint8 spi_tx_data[SPI_DATA_SIZE * 2] __attribute__ ((aligned(4)));
    uint8 spi_rx_data[SPI_DATA_SIZE * 2] __attribute__ ((aligned(4)));

    // NOTE spi data transactions are guaranteed to happen at <= 10Hz
    // so no need to copy the buffers, use in place if we're quick about it

    message_t &tx_msg = *reinterpret_cast<message_t * const >(spi_tx_data + SPI_DATA_SIZE);
    message_t const &rx_msg = *reinterpret_cast<message_t const * const >(spi_rx_data);

    ch32_reading_payload_t &payload = *reinterpret_cast<ch32_reading_payload_t *>(tx_msg.body.payload);
    esp_status_payload_t const &rx_payload = *reinterpret_cast<esp_status_payload_t const *>(rx_msg.body.payload);

    // distance sensor admin

    int num_distance_readings;
    volatile uint32 distance_value;
    stopwatch_t distance_timer;

    //

    volatile uint16 vbat_reading;

    button_t button;

    // what have we read so far? (vbat, distance)

    uint32 got_readings = 0;

    // how many boots from standby mode since power on

    int standby_boot = 0;

    //////////////////////////////////////////////////////////////////////

    uint32 state_elapsed_ticks()
    {
        return static_cast<uint32>(static_cast<int32>(ticks) - state_start_ticks);
    }

    //////////////////////////////////////////////////////////////////////

    void set_state(state_t new_state)
    {
        debug("set_state [%s] (%d) after %d ticks\n", state_name[new_state], new_state, state_elapsed_ticks());
        state_start_ticks = ticks;
        state = new_state;
    }

    //////////////////////////////////////////////////////////////////////
    // sleep for some amount of time
    //
    // 61440 / 128000 = 0.48 seconds per tick
    // 63(64?) ticks per loop = 30.24(30.72?) seconds - measured w/PPK at ~30.6 seconds (loop overhead?)
    // so to wait for 6 hours, loop count of 705 is about right (seems to be ~3 to 8 seconds shy)
    // the 128kHz LSI clock is probably not that accurate anyway...
    //
    // button wakes it up, hold for > N seconds to set factory_reset flag
    //
    // do not call this from an interrupt handler

