cskilbeck/distance_sensor/firmware/CH32V003F4P6/User/user_main.cpp
    void sleep(uint32 count)
    {
        __disable_irq();

        // switch off the ADC
        ADC1->CTLR2 = 0;

        // switch off all clocks except what we need
        RCC->AHBPCENR = RCC_AHBPeriph_SRAM;
        RCC->APB1PCENR = RCC_APB1Periph_PWR;
        RCC->APB2PCENR = RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO;

        // disable all AFIO remap
        AFIO->PCFR1 = 0;

        // then set all GPIOs input pull down except BUTTON (A2 = pullup), LED (C0 = pull up) and 5VSW (C2 = pullup)
        GPIOA->CFGLR = 0x88888888;
        GPIOC->CFGLR = 0x88888888;
        GPIOD->CFGLR = 0x88888888;
        GPIOA->OUTDR = GPIO_MASK_BUTTON;
        GPIOC->OUTDR = GPIO_MASK_LED | GPIO_MASK_5VSW;
        GPIOD->OUTDR = 0;

        // set clock to 8MHz HSI, switch off the PLL
        RCC->CFGR0 |= RCC_HPRE_DIV3;
        RCC->CTLR &= ~RCC_PLLON;

        // switch off SysTick
        SysTick->CTLR = 0;

        // EXTI line 2 on port A (A2... right?)
        AFIO->EXTICR = GPIO_PortSourceGPIOA << GPIO_PIN_BUTTON;

        // configure EXTI_Line9 (auto wakeup) and EXTI_Line2 (button) event falling triggers
        EXTI->INTENR = 0;
        EXTI->EVENR = EXTI_Line9 | EXTI_Line2;
        EXTI->RTENR = 0;
        EXTI->FTENR = EXTI_Line9 | EXTI_Line2;

        // switch on 128kHz LSI
        RCC->RSTSCKR |= RCC_LSION;

        // wait for it to stabilize
        while((RCC->RSTSCKR & RCC_LSIRDY) == 0) {
        }

        // setup auto wakeup every ~30seconds
        PWR->AWUCSR &= ~PWR_AWUEN;
        PWR->AWUPSC = PWR_AWU_Prescaler_61440;
        PWR->AWUWR = 63;
        PWR->AWUCSR |= PWR_AWUEN;

        // prepare standby mode
        PWR->CTLR = PWR_CTLR_PDDS;
        NVIC->SCTLR |= PFIC_SCTLR_SLEEPDEEP | PFIC_SCTLR_WFITOWFE;

        // 1st WFI seems to be ignored for some reason...? am I not clearing something? irq pending?
        asm volatile ("wfi");

        // go into standby N times for some amount of time, button wakes it up

#pragma GCC unroll 0
        for(uint32 i = count; i != 0; --i) {
            asm volatile ("wfi");
            if(GPIO_Get(GPIO_PORT_BUTTON, GPIO_MASK_BUTTON) == 0) {
                break;
            }
        }

        // disable sleep/standby stuff
        EXTI->INTENR = 0;
        EXTI->EVENR = 0;
        EXTI->RTENR = 0;
        EXTI->FTENR = 0;
        RCC->RSTSCKR &= ~RCC_LSION;
        PWR->AWUCSR &= ~PWR_AWUEN;
        PWR->CTLR &= ~PWR_CTLR_PDDS;

        // set systick to 8MHz/8000 = 1ms
        SysTick->CTLR = 0;
        SysTick->SR = 0;
        SysTick->CMP = 8000 - 1;
        SysTick->CNT = 0;
        SysTick->CTLR = SYSTICK_CTLR_ENABLE | SYSTICK_CTLR_HCLK | SYSTICK_CTLR_AUTORE;

        SystemInit();        // reinit System Clock to 48MHz HSI

        __enable_irq();

        standby_boot += 1;

        init_peripherals();

        button.pressed = 0;
        button.released = 0;

        state_start_ticks = 0;
        set_state(state_boot);
    }

    //////////////////////////////////////////////////////////////////////

    extern "C" void SysTick_Handler(void)
    {
        SysTick->SR &= ~SYSTICK_SR_CNTIF;
        button.update(!GPIO_Get(GPIO_PORT_BUTTON, GPIO_MASK_BUTTON));
        ticks += 1;
    }

    //////////////////////////////////////////////////////////////////////

    extern "C" void ADC1_IRQHandler(void)
    {
        ADC1->STATR = ~ADC_EOC;
        vbat_reading = (uint16_t)ADC1->RDATAR;
        GPIO_Clear(GPIO_PORT_VBAT_SNS_EN, GPIO_MASK_VBAT_SNS_EN);
        vbat_status = status_complete;
    }

    //////////////////////////////////////////////////////////////////////

    extern "C" void TIM1_CC_IRQHandler(void)
    {
        if((TIM1->INTFR & TIM_IT_CC2) != 0) {
            distance_value = TIM1->CH2CVR;
            distance_status = status_complete;
        }
        TIM1->INTFR = ~(TIM_IT_CC1 | TIM_IT_CC2);
    }

    //////////////////////////////////////////////////////////////////////

    void DMA1_Channel2_IRQHandler(void)
    {
        DMA1->INTFCR = DMA1_FLAG_TC2;
    }

    //////////////////////////////////////////////////////////////////////

    void DMA1_Channel3_IRQHandler(void)
    {
        spi_status = status_complete;
        DMA1->INTFCR = DMA1_FLAG_TC3;
        spi_start();
    }

    //////////////////////////////////////////////////////////////////////
    // UART1 for printf/getchar

    void init_uart1(void)
    {
        RCC->APB2PCENR |= RCC_APB2Periph_GPIOD | RCC_APB2Periph_USART1 | RCC_APB2Periph_AFIO;

        GPIO_Setup(GPIO_PORT_TX, GPIO_PIN_TX, GPIO_OUT_AF_PP_10MHZ);

        {
            USART_InitTypeDef USART_InitStructure;
            USART_InitStructure.USART_BaudRate = 115200;
            USART_InitStructure.USART_WordLength = USART_WordLength_8b;
            USART_InitStructure.USART_StopBits = USART_StopBits_1;
            USART_InitStructure.USART_Parity = USART_Parity_No;
            USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            USART_InitStructure.USART_Mode = USART_Mode_Tx;
            USART_Init(USART1, &USART_InitStructure);
        }

        USART1->CTLR1 |= USART_CTLR1_UE;
    }

    //////////////////////////////////////////////////////////////////////

    void flush_printf()
    {
        // wait for transfer empty and transfer complete
        uint32 constexpr flags = (USART_STATR_TC | USART_STATR_TXE);
        while((USART1->STATR & flags) != flags) {
        }
    }

    //////////////////////////////////////////////////////////////////////

    uint32 stopwatch_t::elapsed() const
    {
        return static_cast<uint32>(static_cast<int32>(ticks) - now);
    }

    //////////////////////////////////////////////////////////////////////

    void stopwatch_t::reset()
    {
        now = ticks;
    }

    //////////////////////////////////////////////////////////////////////

    void button_t::update(int state)
    {
        held = state;
        history = (history << 1) | state;
        if(history == 0x0001) {
            pressed = 1;
        } else if(history == 0xfffe) {
            released = 1;
        }
    }

    //////////////////////////////////////////////////////////////////////

    void init_button()
    {
        RCC->APB2PCENR |= RCC_APB2Periph_GPIOA;

        GPIO_Setup(GPIO_PORT_BUTTON, GPIO_PIN_BUTTON, GPIO_IN_PULLUP_DOWN);
        GPIO_SetPullup(GPIO_PORT_BUTTON, GPIO_MASK_BUTTON);

        button.history = 0;
        button.flags = 0;
    }

    //////////////////////////////////////////////////////////////////////
    // Timer 2 channel 2 (GPIO D3) is SEND pulse

