cskilbeck/distance_sensor/firmware/CH32V003F4P6/User/user_main.cpp
        SPI1->CTLR1 = (SPI1->CTLR1 & SPI_CTLR1_CLEAR_Mask)
                        | SPI_Direction_2Lines_FullDuplex
                        | SPI_CPOL_High
                        | SPI_CPHA_1Edge
                        | SPI_NSS_Hard
                        | SPI_BaudRatePrescaler_2
                        | SPI_FirstBit_MSB;

        SPI1->CRCR = 7;

        DMA1_Channel2->CFGR = (DMA1_Channel2->CFGR & DMA_CFGR_CLEAR_Mask)
                        | DMA_DIR_PeripheralSRC
                        | DMA_Mode_Normal
                        | DMA_PeripheralInc_Disable
                        | DMA_MemoryInc_Enable
                        | DMA_PeripheralDataSize_Byte
                        | DMA_MemoryDataSize_Byte
                        | DMA_Priority_Medium
                        | DMA_M2M_Disable;

        DMA1_Channel2->CNTR = SPI_DATA_SIZE * 2;
        DMA1_Channel2->PADDR = reinterpret_cast<uint32>(&SPI1->DATAR);
        DMA1_Channel2->MADDR = reinterpret_cast<uint32>(spi_rx_data);

        DMA1_Channel3->CFGR = (DMA1_Channel3->CFGR & DMA_CFGR_CLEAR_Mask)
                        | DMA_DIR_PeripheralDST
                        | DMA_Mode_Normal
                        | DMA_PeripheralInc_Disable
                        | DMA_MemoryInc_Enable
                        | DMA_PeripheralDataSize_Byte
                        | DMA_MemoryDataSize_Byte
                        | DMA_Priority_Medium
                        | DMA_M2M_Disable;

        DMA1_Channel3->CNTR = SPI_DATA_SIZE * 2;
        DMA1_Channel3->PADDR = reinterpret_cast<uint32>(&SPI1->DATAR);
        DMA1_Channel3->MADDR = reinterpret_cast<uint32>(spi_tx_data);

        DMA1->INTFCR = 0xffff;

        SPI1->CTLR2 |= SPI_I2S_DMAReq_Rx | SPI_I2S_DMAReq_Tx;

        NVIC_EnableIRQ(DMA1_Channel2_IRQn);
        NVIC_EnableIRQ(DMA1_Channel3_IRQn);

        DMA1_Channel2->CFGR |= DMA_IT_TC;
        DMA1_Channel3->CFGR |= DMA_IT_TC;

        spi_status = status_idle;
    }

    //////////////////////////////////////////////////////////////////////
    // order here is important:
    // disable SPI, disable DMA, setup DMA, enable SPI, enable DMA

    void spi_start()
    {
        SPI1->CTLR1 &= ~SPI_CTLR1_SPE;
        DMA1_Channel2->CFGR &= ~DMA_CFGR1_EN;
        DMA1_Channel3->CFGR &= ~DMA_CFGR1_EN;

        DMA1_Channel2->MADDR = reinterpret_cast<uint32>(spi_rx_data);
        DMA1_Channel3->MADDR = reinterpret_cast<uint32>(spi_tx_data);
        DMA1_Channel2->CNTR = SPI_DATA_SIZE * 2;
        DMA1_Channel3->CNTR = SPI_DATA_SIZE * 2;

        SPI1->CTLR1 |= SPI_CTLR1_SPE;    // NOTE: you must enable the SPI before the DMA otherwise you get spurious bytes!
        DMA1_Channel2->CFGR |= DMA_CFGR1_EN;
        DMA1_Channel3->CFGR |= DMA_CFGR1_EN;
    }

    //////////////////////////////////////////////////////////////////////

    void init_led()
    {
        RCC->APB2PCENR |= RCC_APB2Periph_GPIOC;

        GPIO_Set(GPIO_PORT_LED, GPIO_MASK_LED);
        GPIO_Setup(GPIO_PORT_LED, GPIO_PIN_LED, GPIO_OUT_PP_10MHZ);
    }

    //////////////////////////////////////////////////////////////////////

    void init_power()
    {
        RCC->APB2PCENR |= RCC_APB2Periph_GPIOC;

        GPIO_Clear(GPIO_PORT_EN_3V3, GPIO_MASK_EN_3V3);
        GPIO_Set(GPIO_PORT_5VSW, GPIO_MASK_5VSW);

        GPIO_Setup(GPIO_PORT_EN_3V3, GPIO_PIN_EN_3V3, GPIO_OUT_PP_10MHZ);
        GPIO_Setup(GPIO_PORT_5VSW, GPIO_PIN_5VSW, GPIO_OUT_PP_10MHZ);
    }

    //////////////////////////////////////////////////////////////////////

    void init_peripherals()
    {
        // clear the RCC reset flag
        RCC->RSTSCKR |= RCC_RMVF;

        // clear and enable all pending RCC irqs
        RCC->INTR = 0xffff;

        // reset the peripherals on apb1, apb2
        uint32 apb1_reset = RCC_TIM2RST | RCC_TIM3RST | RCC_WWDGRST | RCC_I2C1RST;
        uint32 apb2_reset = RCC_AFIORST | RCC_IOPARST | RCC_IOPBRST | RCC_IOPCRST | RCC_IOPDRST | RCC_ADC1RST
                        | RCC_TIM1RST
                        | RCC_SPI1RST;

        RCC->APB1PRSTR |= apb1_reset;
        RCC->APB2PRSTR |= apb2_reset;
        RCC->APB1PRSTR &= ~apb1_reset;
        RCC->APB2PRSTR &= ~apb2_reset;

        // setup all the things (except SPI)
        init_led();
        init_power();
        init_uart1();
        init_button();
        init_timer2();
        init_timer1();
        init_adc();
        init_systick();

        // don't init SPI yet, just listen on CS line for ESP to drive it high
        GPIO_Setup(GPIO_PORT_SPI_CS, GPIO_PIN_SPI_CS, GPIO_IN_PULLUP_DOWN);
        GPIO_SetPullDown(GPIO_PORT_SPI_CS, GPIO_MASK_SPI_CS);

        // switch on VBAT_SNS
        GPIO_Set(GPIO_PORT_VBAT_SNS_EN, GPIO_MASK_VBAT_SNS_EN);

        // don't switch on ESP12 yet
        GPIO_Clear(GPIO_PORT_EN_3V3, GPIO_MASK_EN_3V3);

        // don't switch on the 5V rail for level shifter, distance sensor & ESP12 yet
        GPIO_Clear(GPIO_PORT_5VSW, GPIO_MASK_5VSW);

        // LED off to start with
        GPIO_Set(GPIO_PORT_LED, GPIO_MASK_LED);

        debug("\n\nSysClk:%d (boot %d)\n", SystemCoreClock, standby_boot);
    }
}

//////////////////////////////////////////////////////////////////////

extern "C" int main()
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

    init_peripherals();

    set_state(state_boot);

    while(true) {

        switch(state)
        {
            ////////////////////////////////////////

            case state_boot:
            {
                payload.flags = 0;

                if(button.held && state_elapsed_ticks() >= 5000) {

                    payload.flags |= ch32_flag_factory_reset;
                }

                if((!button.held || (payload.flags & ch32_flag_factory_reset) != 0) && state_elapsed_ticks() > 10) {

                    payload.distance = 0;
                    payload.vbat = 0;

                    // kick off vbat read
                    vbat_status = status_in_progress;
                    ADC_SoftwareStartConvCmd(ADC1, ENABLE);

                    // switch on the 5V rail for level shifter, distance sensor
                    GPIO_Clear(GPIO_PORT_5VSW, GPIO_MASK_5VSW);

                    // and distance reading
                    num_distance_readings = 0;
                    distance_timer.reset();
                    distance_status = status_idle;
                    got_readings = 0;
                    button.released = 0;
                    button.pressed = 0;
                    GPIO_Clear(GPIO_PORT_LED, GPIO_MASK_LED);
                    set_state(state_reading);
                }
            }
            break;

