cskilbeck/distance_sensor/firmware/CH32V003F4P6/User/user_main.cpp
            ////////////////////////////////////////

            case state_reading:
            {
                uint32 elapsed = state_elapsed_ticks();

                if((payload.flags & ch32_flag_factory_reset) != 0) {

                    if(elapsed < 1000 || button.held) {

                        GPIO_SetTo(GPIO_PORT_LED, GPIO_MASK_LED, (elapsed >> 6) & 1);
                        break;
                    }

                } else if(state_elapsed_ticks() > 2) {

                    GPIO_Set(GPIO_PORT_LED, GPIO_MASK_LED);
                }

                // if we got a VBAT reading
                if(vbat_status == status_complete) {

                    // stuff it into the SPI payload
                    payload.vbat = vbat_reading;
                    debug("VBAT: %d (0x%04x)\n", vbat_reading, vbat_reading);
                    vbat_status = status_idle;
                    got_readings |= got_reading_vbat;
                }

                // if we're ready to kick off another distance reading
                if(distance_status == status_idle) {

                    if(distance_timer.elapsed() > 2) {

                        distance_status = status_in_progress;
                        TIM_Cmd(TIM2, ENABLE);
                    }

                } else if(distance_status == status_complete) {

                    debug("DISTANCE[%d] = %d [0x%04x]\n", num_distance_readings, distance_value, distance_value);

                    num_distance_readings += 1;

                    if(distance_value <= MAX_VALID_DISTANCE) {

                        payload.distance = distance_value;
                        got_readings |= got_reading_distance;

                    } else if(num_distance_readings < MAX_DISTANCE_TRIES) {

                        distance_timer.reset();
                        distance_status = status_idle;

                    } else {

                        payload.distance = 0;
                        payload.flags |= ch32_flag_error_distance_invalid;
                        got_readings |= got_reading_distance;
                    }
                }

                // got VBAT and distance readings (or timed out)
                if(got_readings == got_reading_all || state_elapsed_ticks() > 1000) {

                    if((got_readings & got_reading_vbat) == 0) {
                        debug("Huh? no vbat reading...\n");
                        payload.flags |= ch32_flag_error_reading_vbat;
                    }

                    if((got_readings & got_reading_distance) == 0) {
                        debug("Huh? no distance reading...\n");
                        payload.flags |= ch32_flag_error_reading_distance;
                    }

                    // switch off the blasted led for sure
                    GPIO_Set(GPIO_PORT_LED, GPIO_MASK_LED);

                    // finalize the spi payload
                    init_message<ch32_reading_payload_t>(&tx_msg);

                    // switch on ESP, start listening for it on SPI_CS
                    GPIO_Set(GPIO_PORT_EN_3V3, GPIO_MASK_EN_3V3);
                    set_state(state_wait_for_esp);
                }
            }
            break;

            ////////////////////////////////////////
            // don't switch on the SPI until the ESP has driven SPI CS high
            // otherwise spurious CS line shenanigans cause a headache

            case state_wait_for_esp:
            {
                if(state_elapsed_ticks() > 100 && GPIO_Get(GPIO_PORT_SPI_CS, GPIO_MASK_SPI_CS) != 0) {

                    init_spi();
                    spi_start();
                    set_state(state_esp);
                }
            }
            break;

            ////////////////////////////////////////

            case state_esp:
            {
                // SPI transaction completed
                if(spi_status == status_complete) {

                    spi_status = status_idle;

                    bool ch32_ok = check_crc32(&rx_msg);
                    bool esp_ok = (rx_payload.flags & esp_status_spi_error) == 0;

                    if(!ch32_ok) {

                        debug("RECV SPI ERROR! Resetting SPI (got %08x, expected %08x) ID %02x, LEN %02x\n",
                                        rx_msg.crc, calc_crc32(reinterpret_cast<uint8_t const *>(&rx_msg.body), sizeof(message_body_t)),
                                        rx_msg.body.ident, rx_msg.body.length);
                        init_spi();
                        spi_start();
                    }

                    else if(!esp_ok) {

                        debug("SEND SPI ERROR! Resetting SPI\n");

                    } else {

                        if((rx_payload.flags & esp_status_factory_resetting) != 0) {

                            payload.flags &= ~ch32_flag_factory_reset;
                            init_message<ch32_reading_payload_t>(&tx_msg);
                        }

                        if((rx_payload.flags & esp_status_done) != 0) {

                            debug("ESP done: %04x\n", rx_payload.flags);
                            set_state(state_done);
                        }
                    }
                }
            }
            break;

            ////////////////////////////////////////

            case state_done:
            {
                if(state_elapsed_ticks() > SLEEP_DELAY_TICKS) {

                    debug("DONE Sleeping...\n");
                    flush_printf();
                    sleep(705);    // should be about 6 hours
                }
            }
            break;
        }

        // @DEBUG button puts it to sleep for ~30 seconds

        if(button.pressed) {
            stopwatch_t debounce;
            debounce.reset();
            while(debounce.elapsed() < 10) {
                if(button.held) {
                    debounce.reset();
                }
            }
            debug("BUTTON Sleeping...\n");
            flush_printf();
            sleep(1);
        }
    }
}
